SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_mvp.h
/* Bit fields for MVP IEN */
#define _MVP_IEN_RESETVALUE                             0x00000000UL                             /**< Default value for MVP_IEN                   */
#define _MVP_IEN_MASK                                   0x1F0FFDFFUL                             /**< Mask for MVP_IEN                            */
#define MVP_IEN_PROGDONE                                (0x1UL << 0)                             /**< Program Done Interrupt Enable               */
#define _MVP_IEN_PROGDONE_SHIFT                         0                                        /**< Shift value for MVP_PROGDONE                */
#define _MVP_IEN_PROGDONE_MASK                          0x1UL                                    /**< Bit mask for MVP_PROGDONE                   */
#define _MVP_IEN_PROGDONE_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_PROGDONE_DEFAULT                        (_MVP_IEN_PROGDONE_DEFAULT << 0)         /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP0DONE                               (0x1UL << 1)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP0DONE_SHIFT                        1                                        /**< Shift value for MVP_LOOP0DONE               */
#define _MVP_IEN_LOOP0DONE_MASK                         0x2UL                                    /**< Bit mask for MVP_LOOP0DONE                  */
#define _MVP_IEN_LOOP0DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP0DONE_DEFAULT                       (_MVP_IEN_LOOP0DONE_DEFAULT << 1)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP1DONE                               (0x1UL << 2)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP1DONE_SHIFT                        2                                        /**< Shift value for MVP_LOOP1DONE               */
#define _MVP_IEN_LOOP1DONE_MASK                         0x4UL                                    /**< Bit mask for MVP_LOOP1DONE                  */
#define _MVP_IEN_LOOP1DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP1DONE_DEFAULT                       (_MVP_IEN_LOOP1DONE_DEFAULT << 2)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP2DONE                               (0x1UL << 3)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP2DONE_SHIFT                        3                                        /**< Shift value for MVP_LOOP2DONE               */
#define _MVP_IEN_LOOP2DONE_MASK                         0x8UL                                    /**< Bit mask for MVP_LOOP2DONE                  */
#define _MVP_IEN_LOOP2DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP2DONE_DEFAULT                       (_MVP_IEN_LOOP2DONE_DEFAULT << 3)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP3DONE                               (0x1UL << 4)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP3DONE_SHIFT                        4                                        /**< Shift value for MVP_LOOP3DONE               */
#define _MVP_IEN_LOOP3DONE_MASK                         0x10UL                                   /**< Bit mask for MVP_LOOP3DONE                  */
#define _MVP_IEN_LOOP3DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP3DONE_DEFAULT                       (_MVP_IEN_LOOP3DONE_DEFAULT << 4)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP4DONE                               (0x1UL << 5)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP4DONE_SHIFT                        5                                        /**< Shift value for MVP_LOOP4DONE               */
#define _MVP_IEN_LOOP4DONE_MASK                         0x20UL                                   /**< Bit mask for MVP_LOOP4DONE                  */
#define _MVP_IEN_LOOP4DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP4DONE_DEFAULT                       (_MVP_IEN_LOOP4DONE_DEFAULT << 5)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP5DONE                               (0x1UL << 6)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP5DONE_SHIFT                        6                                        /**< Shift value for MVP_LOOP5DONE               */
#define _MVP_IEN_LOOP5DONE_MASK                         0x40UL                                   /**< Bit mask for MVP_LOOP5DONE                  */
#define _MVP_IEN_LOOP5DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP5DONE_DEFAULT                       (_MVP_IEN_LOOP5DONE_DEFAULT << 6)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP6DONE                               (0x1UL << 7)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP6DONE_SHIFT                        7                                        /**< Shift value for MVP_LOOP6DONE               */
#define _MVP_IEN_LOOP6DONE_MASK                         0x80UL                                   /**< Bit mask for MVP_LOOP6DONE                  */
#define _MVP_IEN_LOOP6DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP6DONE_DEFAULT                       (_MVP_IEN_LOOP6DONE_DEFAULT << 7)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOP7DONE                               (0x1UL << 8)                             /**< Loop Done Interrupt Enable                  */
#define _MVP_IEN_LOOP7DONE_SHIFT                        8                                        /**< Shift value for MVP_LOOP7DONE               */
#define _MVP_IEN_LOOP7DONE_MASK                         0x100UL                                  /**< Bit mask for MVP_LOOP7DONE                  */
#define _MVP_IEN_LOOP7DONE_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOP7DONE_DEFAULT                       (_MVP_IEN_LOOP7DONE_DEFAULT << 8)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_ALUNAN                                  (0x1UL << 10)                            /**< Not-a-Number Interrupt Enable               */
#define _MVP_IEN_ALUNAN_SHIFT                           10                                       /**< Shift value for MVP_ALUNAN                  */
#define _MVP_IEN_ALUNAN_MASK                            0x400UL                                  /**< Bit mask for MVP_ALUNAN                     */
#define _MVP_IEN_ALUNAN_DEFAULT                         0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_ALUNAN_DEFAULT                          (_MVP_IEN_ALUNAN_DEFAULT << 10)          /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_R0POSREAL                               (0x1UL << 11)                            /**< R0 Non-Zero Interrupt Enable                */
#define _MVP_IEN_R0POSREAL_SHIFT                        11                                       /**< Shift value for MVP_R0POSREAL               */
#define _MVP_IEN_R0POSREAL_MASK                         0x800UL                                  /**< Bit mask for MVP_R0POSREAL                  */
#define _MVP_IEN_R0POSREAL_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_R0POSREAL_DEFAULT                       (_MVP_IEN_R0POSREAL_DEFAULT << 11)       /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_ALUOF                                   (0x1UL << 12)                            /**< ALU Overflow Interrupt Enable               */
#define _MVP_IEN_ALUOF_SHIFT                            12                                       /**< Shift value for MVP_ALUOF                   */
#define _MVP_IEN_ALUOF_MASK                             0x1000UL                                 /**< Bit mask for MVP_ALUOF                      */
#define _MVP_IEN_ALUOF_DEFAULT                          0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_ALUOF_DEFAULT                           (_MVP_IEN_ALUOF_DEFAULT << 12)           /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_ALUUF                                   (0x1UL << 13)                            /**< ALU Underflow Interrupt Enable              */
#define _MVP_IEN_ALUUF_SHIFT                            13                                       /**< Shift value for MVP_ALUUF                   */
#define _MVP_IEN_ALUUF_MASK                             0x2000UL                                 /**< Bit mask for MVP_ALUUF                      */
#define _MVP_IEN_ALUUF_DEFAULT                          0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_ALUUF_DEFAULT                           (_MVP_IEN_ALUUF_DEFAULT << 13)           /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_STORECONVERTOF                          (0x1UL << 14)                            /**< Store conversion Overflow Interrupt Enable  */
#define _MVP_IEN_STORECONVERTOF_SHIFT                   14                                       /**< Shift value for MVP_STORECONVERTOF          */
#define _MVP_IEN_STORECONVERTOF_MASK                    0x4000UL                                 /**< Bit mask for MVP_STORECONVERTOF             */
#define _MVP_IEN_STORECONVERTOF_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_STORECONVERTOF_DEFAULT                  (_MVP_IEN_STORECONVERTOF_DEFAULT << 14)  /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_STORECONVERTUF                          (0x1UL << 15)                            /**< Store Conversion Underflow Interrupt Enable */
#define _MVP_IEN_STORECONVERTUF_SHIFT                   15                                       /**< Shift value for MVP_STORECONVERTUF          */
#define _MVP_IEN_STORECONVERTUF_MASK                    0x8000UL                                 /**< Bit mask for MVP_STORECONVERTUF             */
#define _MVP_IEN_STORECONVERTUF_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_STORECONVERTUF_DEFAULT                  (_MVP_IEN_STORECONVERTUF_DEFAULT << 15)  /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_STORECONVERTINF                         (0x1UL << 16)                            /**< Store Conversion Infinity Interrupt Enable  */
#define _MVP_IEN_STORECONVERTINF_SHIFT                  16                                       /**< Shift value for MVP_STORECONVERTINF         */
#define _MVP_IEN_STORECONVERTINF_MASK                   0x10000UL                                /**< Bit mask for MVP_STORECONVERTINF            */
#define _MVP_IEN_STORECONVERTINF_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_STORECONVERTINF_DEFAULT                 (_MVP_IEN_STORECONVERTINF_DEFAULT << 16) /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_STORECONVERTNAN                         (0x1UL << 17)                            /**< Store Conversion NaN Interrupt Enable       */
#define _MVP_IEN_STORECONVERTNAN_SHIFT                  17                                       /**< Shift value for MVP_STORECONVERTNAN         */
#define _MVP_IEN_STORECONVERTNAN_MASK                   0x20000UL                                /**< Bit mask for MVP_STORECONVERTNAN            */
#define _MVP_IEN_STORECONVERTNAN_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_STORECONVERTNAN_DEFAULT                 (_MVP_IEN_STORECONVERTNAN_DEFAULT << 17) /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_PERFCNT0                                (0x1UL << 18)                            /**< Perf Counter 0 Overflow Interrupt Enable    */
#define _MVP_IEN_PERFCNT0_SHIFT                         18                                       /**< Shift value for MVP_PERFCNT0                */
#define _MVP_IEN_PERFCNT0_MASK                          0x40000UL                                /**< Bit mask for MVP_PERFCNT0                   */
#define _MVP_IEN_PERFCNT0_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_PERFCNT0_DEFAULT                        (_MVP_IEN_PERFCNT0_DEFAULT << 18)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_PERFCNT1                                (0x1UL << 19)                            /**< Perf Counter 1 Overflow Interrupt Enable    */
#define _MVP_IEN_PERFCNT1_SHIFT                         19                                       /**< Shift value for MVP_PERFCNT1                */
#define _MVP_IEN_PERFCNT1_MASK                          0x80000UL                                /**< Bit mask for MVP_PERFCNT1                   */
#define _MVP_IEN_PERFCNT1_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_PERFCNT1_DEFAULT                        (_MVP_IEN_PERFCNT1_DEFAULT << 19)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_LOOPFAULT                               (0x1UL << 24)                            /**< Loop Fault Interrupt Enable                 */
#define _MVP_IEN_LOOPFAULT_SHIFT                        24                                       /**< Shift value for MVP_LOOPFAULT               */
#define _MVP_IEN_LOOPFAULT_MASK                         0x1000000UL                              /**< Bit mask for MVP_LOOPFAULT                  */
#define _MVP_IEN_LOOPFAULT_DEFAULT                      0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_LOOPFAULT_DEFAULT                       (_MVP_IEN_LOOPFAULT_DEFAULT << 24)       /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_BUSERRFAULT                             (0x1UL << 25)                            /**< Bus Error Fault Interrupt Enable            */
#define _MVP_IEN_BUSERRFAULT_SHIFT                      25                                       /**< Shift value for MVP_BUSERRFAULT             */
#define _MVP_IEN_BUSERRFAULT_MASK                       0x2000000UL                              /**< Bit mask for MVP_BUSERRFAULT                */
#define _MVP_IEN_BUSERRFAULT_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_BUSERRFAULT_DEFAULT                     (_MVP_IEN_BUSERRFAULT_DEFAULT << 25)     /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_BUSALIGNFAULT                           (0x1UL << 26)                            /**< Bus Alignment Fault Interrupt Enable        */
#define _MVP_IEN_BUSALIGNFAULT_SHIFT                    26                                       /**< Shift value for MVP_BUSALIGNFAULT           */
#define _MVP_IEN_BUSALIGNFAULT_MASK                     0x4000000UL                              /**< Bit mask for MVP_BUSALIGNFAULT              */
#define _MVP_IEN_BUSALIGNFAULT_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_BUSALIGNFAULT_DEFAULT                   (_MVP_IEN_BUSALIGNFAULT_DEFAULT << 26)   /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_ALUFAULT                                (0x1UL << 27)                            /**< ALU Input Fault Interrupt Enable            */
#define _MVP_IEN_ALUFAULT_SHIFT                         27                                       /**< Shift value for MVP_ALUFAULT                */
#define _MVP_IEN_ALUFAULT_MASK                          0x8000000UL                              /**< Bit mask for MVP_ALUFAULT                   */
#define _MVP_IEN_ALUFAULT_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_ALUFAULT_DEFAULT                        (_MVP_IEN_ALUFAULT_DEFAULT << 27)        /**< Shifted mode DEFAULT for MVP_IEN            */
#define MVP_IEN_ARRAYFAULT                              (0x1UL << 28)                            /**< Array Fault Interrupt Enable                */
#define _MVP_IEN_ARRAYFAULT_SHIFT                       28                                       /**< Shift value for MVP_ARRAYFAULT              */
#define _MVP_IEN_ARRAYFAULT_MASK                        0x10000000UL                             /**< Bit mask for MVP_ARRAYFAULT                 */
#define _MVP_IEN_ARRAYFAULT_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for MVP_IEN                    */
#define MVP_IEN_ARRAYFAULT_DEFAULT                      (_MVP_IEN_ARRAYFAULT_DEFAULT << 28)      /**< Shifted mode DEFAULT for MVP_IEN            */

/* Bit fields for MVP FAULTSTATUS */
#define _MVP_FAULTSTATUS_RESETVALUE                     0x00000000UL                                  /**< Default value for MVP_FAULTSTATUS           */
#define _MVP_FAULTSTATUS_MASK                           0x000F3707UL                                  /**< Mask for MVP_FAULTSTATUS                    */
#define _MVP_FAULTSTATUS_FAULTPC_SHIFT                  0                                             /**< Shift value for MVP_FAULTPC                 */
#define _MVP_FAULTSTATUS_FAULTPC_MASK                   0x7UL                                         /**< Bit mask for MVP_FAULTPC                    */
#define _MVP_FAULTSTATUS_FAULTPC_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for MVP_FAULTSTATUS            */
#define MVP_FAULTSTATUS_FAULTPC_DEFAULT                 (_MVP_FAULTSTATUS_FAULTPC_DEFAULT << 0)       /**< Shifted mode DEFAULT for MVP_FAULTSTATUS    */
#define _MVP_FAULTSTATUS_FAULTARRAY_SHIFT               8                                             /**< Shift value for MVP_FAULTARRAY              */
#define _MVP_FAULTSTATUS_FAULTARRAY_MASK                0x700UL                                       /**< Bit mask for MVP_FAULTARRAY                 */
#define _MVP_FAULTSTATUS_FAULTARRAY_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for MVP_FAULTSTATUS            */
#define MVP_FAULTSTATUS_FAULTARRAY_DEFAULT              (_MVP_FAULTSTATUS_FAULTARRAY_DEFAULT << 8)    /**< Shifted mode DEFAULT for MVP_FAULTSTATUS    */
#define _MVP_FAULTSTATUS_FAULTBUS_SHIFT                 12                                            /**< Shift value for MVP_FAULTBUS                */
#define _MVP_FAULTSTATUS_FAULTBUS_MASK                  0x3000UL                                      /**< Bit mask for MVP_FAULTBUS                   */
#define _MVP_FAULTSTATUS_FAULTBUS_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for MVP_FAULTSTATUS            */
#define _MVP_FAULTSTATUS_FAULTBUS_NONE                  0x00000000UL                                  /**< Mode NONE for MVP_FAULTSTATUS               */
#define _MVP_FAULTSTATUS_FAULTBUS_LOAD0STREAM           0x00000001UL                                  /**< Mode LOAD0STREAM for MVP_FAULTSTATUS        */
#define _MVP_FAULTSTATUS_FAULTBUS_LOAD1STREAM           0x00000002UL                                  /**< Mode LOAD1STREAM for MVP_FAULTSTATUS        */
#define _MVP_FAULTSTATUS_FAULTBUS_STORESTREAM           0x00000003UL                                  /**< Mode STORESTREAM for MVP_FAULTSTATUS        */
#define MVP_FAULTSTATUS_FAULTBUS_DEFAULT                (_MVP_FAULTSTATUS_FAULTBUS_DEFAULT << 12)     /**< Shifted mode DEFAULT for MVP_FAULTSTATUS    */
#define MVP_FAULTSTATUS_FAULTBUS_NONE                   (_MVP_FAULTSTATUS_FAULTBUS_NONE << 12)        /**< Shifted mode NONE for MVP_FAULTSTATUS       */
#define MVP_FAULTSTATUS_FAULTBUS_LOAD0STREAM            (_MVP_FAULTSTATUS_FAULTBUS_LOAD0STREAM << 12) /**< Shifted mode LOAD0STREAM for MVP_FAULTSTATUS*/
#define MVP_FAULTSTATUS_FAULTBUS_LOAD1STREAM            (_MVP_FAULTSTATUS_FAULTBUS_LOAD1STREAM << 12) /**< Shifted mode LOAD1STREAM for MVP_FAULTSTATUS*/
#define MVP_FAULTSTATUS_FAULTBUS_STORESTREAM            (_MVP_FAULTSTATUS_FAULTBUS_STORESTREAM << 12) /**< Shifted mode STORESTREAM for MVP_FAULTSTATUS*/
#define _MVP_FAULTSTATUS_FAULTLOOP_SHIFT                16                                            /**< Shift value for MVP_FAULTLOOP               */
#define _MVP_FAULTSTATUS_FAULTLOOP_MASK                 0xF0000UL                                     /**< Bit mask for MVP_FAULTLOOP                  */
#define _MVP_FAULTSTATUS_FAULTLOOP_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for MVP_FAULTSTATUS            */
#define MVP_FAULTSTATUS_FAULTLOOP_DEFAULT               (_MVP_FAULTSTATUS_FAULTLOOP_DEFAULT << 16)    /**< Shifted mode DEFAULT for MVP_FAULTSTATUS    */

